app/controllers/pins_controller.rb

INSERT INTO "pins" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-20 23:53:17.439131"], ["description", "blah"], ["title", "Test Pin"], ["updated_at", "2014-11-20 23:53:17.439131"], ["user_id", 1]]
---
	def create
		@pin = current_user.pins.build(pin_params)
		if @pin.save

UPDATE "pins" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "pins"."id" = 9  [["image_file_name", "00034800.jpg"], ["image_file_size", 142203], ["image_updated_at", "2014-11-21 01:41:43.296466"], ["updated_at", "2014-11-21 01:41:44.029666"]]
---
	def update
		if @pin.update(pin_params)